---
title: "重构与模式 读书笔记"
tags: undefine
---




#目录#
:
  1. 本书的写作缘由　1
    1. 1.1　过度设计　1
    1. 1.2　模式万灵丹　2
    1. 1.3　设计不足　2
    1. 1.4　测试驱动开发和持续重构　3
    1. 1.5　重构与模式　5
    1. 1.6　演进式设计　6
  1. 重构　7
    1. 2.1　何谓重构　7
    1. 2.2　重构的动机　8
    1. 2.3　众目睽睽　9
    1. 2.4　可读性好的代码　10
    1. 2.5　保持清晰　11
    1. 2.6　循序渐进　11
    1. 2.7　设计欠账　12
    1. 2.8　演变出新的架构　13
    1. 2.9　复合重构与测试驱动的重构　13
    1. 2.10　复合重构的优点　15
    1. 2.11　重构工具　15
  1. 模式　17
    1. 3.1　何谓模式　17
    1. 3.2　模式痴迷　18
    1. 3.3　实现模式的方式不止一种　20
    1. 3.4　通过重构实现、趋向和去除模式　22
    1. 3.5　模式是否会使代码更加复杂　24
    1. 3.6　模式知识　25
    1. 3.7　使用模式的预先设计　26
  1. 代码坏味　29
    1. 4.1　重复代码(Duplicated Code)　31
    1. 4.2　方法过长(Long Method)　31
    1. 4.3　条件逻辑太复杂(Conditional Complexity)　32
    1. 4.4　基本类型迷恋(Primitive Obsession)　33
    1. 4.5　不恰当的暴露(Indecent Exposure)　33
    1. 4.6　解决方案蔓延(Solution Sprawl)　34
    1. 4.7　异曲同工的类(Alternative Classes with Different Interfaces)　34
    1. 4.8　冗赘类(Lazy Class)　34
    1. 4.9　类过大(Large Class)　34
    1. 4.10　分支语句(Switch Statement)　35
    1. 4.11　组合爆炸(Combinatorial Explosion)　35
    1. 4.12　怪异解决方案(Oddball Solution)　35
  1. 模式导向的重构目录　37
    1. 5.1　重构的格式　37
    1. 5.2　本目录中引用的项目　38
    1. 5.2.1　XML Builder　39
    1. 5.2.2　HTML Parser　39
    1. 5.2.3　贷款风险计算程序　40
    1. 5.3　起点　40
    1. 5.4　学习顺序　41
  1. 创建　43
    1. 6.1　用Creation Method替换构造函数　44
    1. 6.1.1　动机　44
    1. 6.1.2　做法　46
    1. 6.1.3　示例　46
    1. 6.1.4　变体　51
    1. 6.2　将创建知识搬移到Factory　52
    1. 6.2.1　动机　53
    1. 6.2.2　做法　55
    1. 6.2.3　示例　56
    1. 6.3　用Factory封装类　61
    1. 6.3.1　动机　62
    1. 6.3.2　做法　63
    1. 6.3.3　示例　63
    1. 6.3.4　变体　66
    1. 6.4　用Factory Method引入多态创建　68
    1. 6.4.1　动机　68
    1. 6.4.2　做法　69
    1. 6.4.3　示例　71
    1. 6.5　用Builder封装Composite　74
    1. 6.5.1　做法　76
    1. 6.5.2　示例　77
    1. 6.5.3　变体　87
    1. 6.6　内联Singleton　90
    1. 6.6.1　动机　90
    1. 6.6.2　做法　92
    1. 6.6.3　示例　93
  1. 简化　97
    1. 7.1　组合方法　98
    1. 7.1.1　动机　98
    1. 7.1.2　做法　100
    1. 7.1.3　示例　100
    1. 7.2　用Strategy替换条件逻辑　103
    1. 7.2.1　动机　103
    1. 7.2.2　做法　105
    1. 7.2.3　示例　106
    1. 7.3　将装饰功能搬移到Decorator　115
    1. 7.3.1　动机　115
    1. 7.3.2　做法　119
    1. 7.3.3　示例　120
    1. 7.4　用State替换状态改变条件语句　134
    1. 7.4.1　动机　134
    1. 7.4.2　做法　135
    1. 7.4.3　示例　136
    1. 7.5　用Composite替换隐含树　144
    1. 7.5.1　动机　144
    1. 7.5.2　做法　147
    1. 7.5.3　示例　148
    1. 7.6　用Command替换条件调度程序　155
    1. 7.6.1　动机　156
    1. 7.6.2　做法　157
    1. 7.6.3　示例　158
  1. 泛化　165
    1. 8.1　形成Template Method　166
    1. 8.1.1　动机　167
    1. 8.1.2　做法　168
    1. 8.1.3　示例　168
    1. 8.2　提取Composite　173
    1. 8.2.1　动机　173
    1. 8.2.2　做法　174
    1. 8.2.3　示例　175
    1. 8.3　用Composite替换一/多之分　181
    1. 8.3.1　动机　181
    1. 8.3.2　做法　183
    1. 8.3.3　示例　184
    1. 8.4　用Observer替换硬编码的通知　191
    1. 8.4.1　动机　191
    1. 8.4.2　做法　192
    1. 8.4.3　示例　193
    1. 8.5　通过Adapter统一接口　200
    1. 8.5.1　动机　200
    1. 8.5.2　做法　201
    1. 8.5.3　示例　202
    1. 8.6　提取Adapter　209
    1. 8.6.1　动机　209
    1. 8.6.2　做法　211
    1. 8.6.3　示例　211
    1. 8.6.4　变体　217
    1. 8.7　用Interpreter替换隐式语言　218
    1. 8.7.1　动机　218
    1. 8.7.2　做法　220
    1. 8.7.3　示例　221
  1. 保护　231
    1. 9.1　用类替换类型代码　232
    1. 9.1.1　动机　232
    1. 9.1.2　做法　234
    1. 9.1.3　示例　235
    1. 9.2　用Singleton限制实例化　240
    1. 9.2.1　动机　240
    1. 9.2.2　做法　241
    1. 9.2.3　示例　241
    1. 9.3　引入Null Object　243
    1. 9.3.1　动机　244
    1. 9.3.2　做法　245
    1. 9.3.3　示例　246
  1. 聚集操作　251
    1. 10.1　将聚集操作搬移到Collecting Parameter　252
    1. 10.1.1　动机　252
    1. 10.1.2　做法　253
    1. 10.1.3　示例　254
    1. 10.2　将聚集操作搬移到Visitor　258
    1. 10.2.1　动机　258
    1. 10.2.2　做法　262
    1. 10.2.3　示例　266
  1. 实用重构　273
    1. 11.1　链构造函数　274
    1. 11.1.1　动机　274
    1. 11.1.2　做法　275
    1. 11.1.3　示例　275
    1. 11.2　统一接口　277
    1. 11.2.1　动机　277
    1. 11.2.2　做法　278
    1. 11.2.3　示例　278
    1. 11.3　提取参数　279
    1. 11.3.1　动机　279
    1. 11.3.2　做法　279
    1. 11.3.3　示例　280
  1. 跋　281
  1. 参考文献　283
  1. 索引　287 
